{
  "_meta": {
    "maxChars": {
      "welcome": 20,
      "readyToPlay": 20,
      "pressContinue": 50,
      "greatJob": 20,
      "onePlusOne": 30
    }
  },
  "en": {
    "Title": "Grow Hop",
    "ColoredMenuTitle": "GROW <color=#FFFFFFFF>HOP</color>",
    "StartButton": "Start",
    "ContinueButton": "Continue",
    "LessonButton": "Lesson",
    "GameOver": "Would you like to <b>continue playing</b> for another day?",
    "PlayAgainButton": "Play again",
    "ExitGameButton": "Exit game",
    "Congratulations": "Congratulations!",
    "GrowthAchievement": "Today you <b>grew taller</b> by:",
    "HighScoreNew": "This is your <b>new high score</b>!",
    "HighScoreUnchanged": "Your <b>high score</b> is still:",
    "Day0": "MONDAY",
    "Day1": "TUESDAY",
    "Day2": "WEDNESDAY",
    "Day3": "THURSDAY",
    "Day4": "FRIDAY",
	"Day5": "SATURDAY",
    "Day6": "SUNDAY",
    "Intro1a": "Welcome to <b>Grow Hop</b>!",
    "Intro1b": "To continue:",
    "Intro1c": "<b>touch</b> here, or",
    "Intro1d": "<b>click</b> here, or",
    "Intro1e": "press <b>Enter</b>",
    "Intro2a": "In this game, you’ll be learning about <b>how plants survive and grow</b>.",
    "Intro3a": "First, we’ll be exploring the science of <b>photosynthesis</b> and <b>plant growth</b>.",
    "Intro3b": "At the same time, we’ll show you how to use the game’s <b>controls</b>, and how to understand the <b>information</b> on your screen.",
    "Intro3c": "After that, you’ll get to <b>play the game</b>!",
    "Intro4a": "In the game, you’ll become a <b>plant in a pot</b>, which has mysteriously become able to <b>run</b> and <b>jump</b>.",
    "Intro4b": "The goal is to <b>grow as tall as you can</b>, using everything that you’ve learned.",
    "Intro5a": "You’ll have to <b>chase sunlight</b> and <b>rain</b>, while <b>avoiding</b> or <b>stunning enemies</b>.",
    "Intro5b": "<b>Compete</b> with your friends to see who can grow the <b>tallest</b> or the <b>fastest</b>!",
    "Food1a": "Let’s begin by asking a question.",
    "Food1b": "<b>How do plants survive and grow?</b>",
    "Food1c": "To <b>survive</b> and <b>grow</b>, all life must <b>consume food</b>.",
    "Food1d": "However, different kinds of life consume <b>different kinds</b> of food, and they consume their food in <b>different ways</b>.",
    "Food2a": "Unlike animals, <b>plants can’t eat or digest</b>, because they don’t have mouths, teeth, or stomachs!",
    "Food2b": "So <b>what kind of food</b> do plants consume?",
    "Food2c": "<b>Where</b> do they <b>get it</b> from?",
    "Food2d": "And <b>how</b> do they <b>use it</b> to <b>survive</b> and <b>grow</b>?",
    "Photo1a": "Unlike animals, <b>plants produce their own food</b>!",
    "Photo1b": "They do this through the process of <b>photosynthesis</b>.",
    "Photo2a": "During photosynthesis, plants use <b>energy from sunlight</b> to turn <b>water and carbon dioxide</b> into <b>oxygen and sugar</b>.",
    "Photo2b": "The <b>sugar</b> that a plant produces in photosynthesis is <b>food</b> for the plant.",
    "Photo3a": "<b>Sugar</b>, like all food, contains <b>energy</b> that can be <b>released</b> and <b>used</b> when it is consumed.",
    "Photo3b": "Plants use the <b>energy</b> from their <b>sugar</b> to <b>survive</b>, <b>stay healthy</b>, and <b>grow</b>.",
    "Photo4a": "Photosynthesis is a plant’s way of <b>transforming</b> the <b>energy in sunlight</b> (which it <b>cannot use</b>) into <b>energy in sugar</b> (which it <b>can use</b>).",
    "Photo5a": "Photosynthesis <b>requires</b> the presence of <b>light</b>, <b>water</b>, and <b>carbon dioxide</b>.",
    "Photo5b": "If you <b>remove any one</b> of these, then photosynthesis will be <b>impossible</b>.",
    "Photo6a": "Photosynthesis is <b>necessary for growth</b>: without photosynthesis, a plant cannot grow.",
    "Photo7a": "Photosynthesis is also <b>necessary for health and survival</b>: if a plant is unable to photosynthesize for a long time, it will gradually <b>lose health</b> and eventually <b>die</b>.",
    "Sun1a": "This is your <b>sunlight meter</b>\n(<b>sun</b> icon).",
    "Sun1b": "It shows you <b>how much sunlight</b> is falling on you right now.",
    "Sun2a": "The <b>far left</b> of the meter means <b>no sunlight</b>.",
    "Sun2b": "The <b>far right</b> of the meter means <b>maximum sunlight</b>.",
    "Sun3a": "The <b>colors</b> you see on the meter are important.",
    "Sun3b": "They show you <b>how sunlight relates to photosynthesis</b>.",
    "Sun4a": "<b>High sunlight</b> is <b>green</b> because it is <b>good for photosynthesis</b>.",
    "Sun4b": "<b>Low sunlight</b> is <b>red</b> because it is <b>bad for photosynthesis</b>.",
    "Sun5a": "Always try to <b>stay in the green zone</b>, or as close to it as possible.",
    "Sun5b": "<b>More sunlight is always better</b>.",
    "Sun6a": "Now <b>jump down</b> off the balcony and <b>into the direct sunlight</b>.",
    "Sun6b": "Watch your <b>sunlight meter</b>!",
    "Sun7a": "Well done!",
    "Sun7b": "Notice the <b>high level</b> and <b>green color</b> of your <b>sunlight meter</b>.",
    "Sun7c": "Your sunlight is now at an <b>excellent level for photosynthesis</b>.",
    "Controls1a": "<b>Controls</b> for <b>keyboard</b> users:",
    "Controls1b": "Use the <b>arrow keys</b> (or <b>WASD</b>).",
    "Controls1c": "<b>Move</b>:   left/right (A/D)",
    "Controls1d": "<b>Jump</b>:   up (W)",
    "Controls1e": "<b>Drop</b>:   down (S)",
    "Controls1f": "<b>Tap</b> for <b>small movements</b>.",
    "Controls1g": "<b>Hold down</b> for <b>increased effect</b>.",
    "Controls2a": "<b>Controls</b> for <b>touch</b> / <b>mouse</b> users:",
    "Controls2b": "<b>Touch</b> / <b>click</b> wherever you want to move toward:",
    "Controls2c": "<b>Move</b>:   beside yourself",
    "Controls2d": "<b>Jump</b>:   above yourself",
    "Controls2e": "<b>Drop</b>:   below yourself",
    "Controls2f": "<b>Tap</b> for <b>small movements</b>.",
    "Controls2g": "<b>Hold down</b> for <b>increased effect</b>.",
    "Water1a": "Sunlight alone is <b>not enough for photosynthesis</b>.",
    "Water1b": "<b>Water is also important</b>.",
    "Water2a": "This is your <b>water meter</b>\n(<b>raindrop</b> icon).",
    "Water2b": "It shows you <b>how much water is available</b> for photosynthesis.",
    "Water3a": "The <b>water meter</b> is <b>somewhat different</b> than the <b>sunlight meter</b>.",
    "Water3b": "<b>More water is not always better.</b>",
    "Water4a": "You can have <b>not enough water</b> (left red zone) and <b>too much water</b> (right red zone).",
    "Water4b": "Always try to stay at a <b>medium amount of water</b> (central green zone).",
    "Water5a": "Your water is low. Go <b>collect some rain</b>, but <b>not too much</b>!",
    "Water5b": "Watch your <b>water meter</b>.",
    "Water6a": "You now have <b>enough water</b>.",
    "Water6b": "But it won’t last forever: you will<b> gradually lose water</b>!",
    "Water7a": "You will <b>lose water faster</b> when:",
    "Water7b": "a)  <b>sunlight level is high</b> (more water is evaporated from the soil)",
    "Water7c": "b)  <b>photosynthesis rate is high</b> (more water + carbon dioxide transformed into sugar + oxygen)",
    "Water8a": "<b>Note</b>:",
    "Water8b": "For simplicity, we <b>removed carbon dioxide</b> as a factor in this game, so that <b>only sunlight and water matter</b> for photosynthesis.",
    "Water8c": "For the purposes of this game, you can assume that there’s a <b>constant plentiful supply of carbon dioxide</b> everywhere you go.",
    "PhotoMeter1a": "This is your <b>photosynthesis meter</b>\n(<b>leaf</b> icon).",
    "PhotoMeter1b": "It shows your current <b>photosynthesis rate</b> (how quickly <b>sunlight</b> + <b>water</b> + <b>carbon dioxide</b> are being transformed into <b>sugar</b> + <b>oxygen</b>).",
    "PhotoMeter2a": "Your <b>photosynthesis rate</b> will always be <b>highest</b> when your <b>sunlight meter</b> and your <b>water meter</b> are both in the <b>green zone</b>.",
    "PhotoMeter3a": "At the center of the <b>photosynthesis meter</b> there is a <b>spinning ball</b>. (Visible above 0 photosynthesis.)",
    "PhotoMeter3b": "As your <b>photosynthesis meter increases</b>, the <b>ball spins faster</b>.",
    "PhotoMeter3c": "Think of it like the relationship between a car’s <b>speedometer</b> and its <b>spinning wheels</b>.",
    "FoodMeter1a": "These are your <b>food meters</b>\n(<b>apple</b> icons).",
    "FoodMeter1b": "They show you <b>how much food </b>(sugar) <b>you’ve produced</b>.",
    "FoodMeter1c": "As your <b>photosynthesis rate gets higher</b>, your <b>food builds up faster</b>.",
    "FoodMeter2a": "Now that we have presented all of these meters, take a few moments to <b>experiment</b>.",
    "FoodMeter2b": "Move in and out of the <b>shadows</b>, collect some <b>rain</b>, and <b>watch how your meters behave</b>.",
    "Aphids1a": "The insect on the platform is a <b>giant mutant aphid</b>!",
    "Aphids1b": "It likes to feed on the <b>sugary sap</b> of plants.",
    "Aphids1c": "If you let it touch you, it will <b>steal some of your food</b> and <b>knock you back</b> with mutant strength!",
    "Aphids2a": "Use the <b>platforms</b> to <b>escape</b>!",
    "Aphids2b": "Watch out for the <b>aphid</b>.",
    "Aphids2c": "<b>Avoid</b> it, or else <b>stun</b> it by <b>jumping on top of it</b>.",
    "Growth1a": "Well done!",
    "Growth1b": "Now we’ve seen how <b>producing food</b> through photosynthesis works.",
    "Growth1c": "But how do plants <b>use their food to grow</b>?",
    "Growth2a": "The topic of <b>how plant growth works</b> is <b>complex</b> and <b>detailed</b>, and we won’t go into it much here.",
    "Growth2b": "However, let’s consider <b>two important facts</b>.",
    "Growth3a": "First: as we’ve already established, <b>photosynthesis</b> can only happen <b>during the day</b>.",
    "Growth3b": "However, the same is <b>not true</b> for <b>plant growth</b>!",
    "Growth4a": "In fact, <b>many plants grow fastest</b> during the <b>evening</b> and<b> night</b>, after building up their sugar supply during the day.",
    "Growth4b": "In this game, <b>growth is simplified</b> so that it <b>only happens at night</b>.",
    "Growth5a": "Second: where does the <b>material for growth</b> come from?",
    "Growth5b": "A <b>common misconception</b> is that much of the <b>material</b> out of which <b>new plant matter is formed</b> originally <b>came from the soil</b>.",
    "Growth6a": "<b>Soil</b> does <b>contribute some important nutrients</b> that are <b>used in growth</b>.",
    "Growth6b": "However, the <b>majority</b> of the matter for growth originally <b>comes from air</b> and <b>water</b>.",
    "Growth6c": "Here is one way of <b>scientifically confirming</b> this:",
    "Growth7a": "Begin with a <b>seed</b> and some (dried) <b>soil</b>, and <b>measure the weight of each</b>.",
    "Growth7b": "Then, fill a flowerpot with all the soil and <b>plant the seed in the soil</b>.",
    "Growth7c": "Over a few weeks, let the seed <b>grow into a plant</b>, giving it lots of <b>sunlight</b> and <b>water</b>.",
    "Growth8a": "Then <b>separate</b> the entire <b>plant</b> from the <b>soil</b>.",
    "Growth8b": "Again, <b>measure the weight</b> of both the <b>plant</b> and the (dried) <b>soil</b>.",
    "Growth9a": "You will find that even though the <b>seed</b>/<b>plant</b> has <b>gained weight significantly</b>, the <b>soil</b> has <b>barely lost weight</b> at all.",
    "Growth9b": "All of that <b>new plant matter</b> had to come from somewhere, and now we’ve proven that <b>most of it did not come from the soil</b>!",
    "Growth10a": "Now let’s see your growth in action!",
    "PreGame1": "Now you’re prepared to start the game!",
    "PreGame2": "You will begin at a <b>height</b> of <b>50mm</b>.",
    "PreGame3": "You will have <b>from sunrise to sunset</b> to use <b>photosynthesis</b> to <b>produce food</b> as quickly as you can, so that you can then <b>grow</b> as much as possible <b>at night</b>.",
    "PreGame4": "Play for <b>multiple days</b> and see how <b>tall</b> and <b>quickly</b> you can grow!",
    "PreGame5": "Get ready to begin!",
	"SunReq": "Plants require sun, because science.",
	"GatherSun": "Go gather some sunlight. It is a non-renewable resource, so grab it while you can.",
	"ControlsKey" : "If you are using a keyboard, move using the either the arrow keys or WASD.",
	"ControlsTouch" : "If you are using a mouse or touchscreen, click or touch on the screen, and you will move in the direction of where you clicked/touched.",
	"SunMeter": "Sun! Sun meter!",
	"H20Req": "Plant needs more than just sun. They need water too! Go collect some water.",
	"Evaporation" : "You got enough water, look how it evaps tho",
	"ReqBothForSugar" : "Requires both to produce sugars, and some soil, cant have one of the other, both at same time (minus storage)",
	"Sugar" : "store sugars for growth later through photo",
	"Aphids" : "Aphids are etc, they steal ur sugar",
	"SugarGrowthRate" : "I dont remember",
	"Escape" : "Use the platforms to escape!",
	"SugarsToGrowth" : "How stored sugars become growth in the evening and night"
	 },
  "es": {
    "welcome": "",
    "readyToPlay": "¿Estás listo para jugar?",
    "greatJob": "¡Gran trabajo!",
    "pressContinue": "Presione el botón 'siguiente' para continuar.",
    "onePlusOne": "Uno + Uno = Dos"
  },
  "zh": {
    "welcome": "欢迎！",
    "readyToPlay": "你准备好玩吗",
    "greatJob": "做得好！",
    "pressContinue": "按“下一步”按钮继续。",
    "onePlusOne": "一+一=二"
  },
  "jp": {
    "welcome": "ようこそ!",
    "readyToPlay": "あなたは遊ぶ準備ができていますか？",
    "greatJob": "よくやった！",
    "pressContinue": "続行するには '次へ'ボタンを押してください。",
    "onePlusOne": "1 + 1 = 2"
  },
  "ru": {
    "welcome": "Добро пожаловать!",
    "readyToPlay": "Вы готовы играть?",
    "greatJob": "Отличная работа!",
    "pressContinue": "Нажмите следующую кнопку, чтобы продолжить.",
    "onePlusOne": "один + один"
  }
}
